АлогистикТест2/src/Catalogs/Длины/Длины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Длины</name>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>ДлинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/Длины/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Не РольДоступна("алк_Администратор") Тогда
		Отказ = ЭтоДублер(Владелец, ДлинаММ);	
	КонецЕсли;
	
	СформироватьНаименование();	
	
КонецПроцедуры

Процедура СформироватьНаименование()
	
	Если Владелец = Справочники.КатегорииНоменклатуры.Пиломатериал ИЛИ Владелец = Справочники.КатегорииНоменклатуры.ПиломатериалСП Тогда
		Наименование = Формат(ДлинаММ/1000, "ЧДЦ=3; ЧРД=.; ЧГ=");
		НаименованиеПолное = Формат(ДлинаММ, "ЧГ=") + " (мм.)";
	ИначеЕсли Владелец = Справочники.КатегорииНоменклатуры.Пиловочник ИЛИ Владелец = Справочники.КатегорииНоменклатуры.Окорка Тогда
		Наименование = Формат(ДлинаММ/1000, "ЧРД=.; ЧГ=");
		НаименованиеПолное = Формат(ДлинаММ, "ЧГ=") + " (мм.)";	
	Иначе
		Наименование = Формат(ДлинаММ, "ЧГ=");
		НаименованиеПолное = Наименование + " (мм.)";	
	КонецЕсли; 
	
КонецПроцедуры

Функция ЭтоДублер(ВладелецСправочника, КонтролируемыйРеквизит)
	
	Дубль = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Длины.Ссылка
	|ИЗ
	|	Справочник.Длины КАК Длины
	|ГДЕ
	|	Длины.Владелец = &Владелец
	|	И Длины.ДлинаММ = &ДлинаММ
	|	И НЕ Длины.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", ВладелецСправочника);
	Запрос.УстановитьПараметр("ДлинаММ", КонтролируемыйРеквизит);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Дубль = Истина;
		
	КонецЕсли; 
	
	Возврат Дубль;
	
КонецФункции // ЭтоДублер()
